coolcourses/app/controllers/courses_controller.rb

  def index
    @courses = CourseDecorator.decorate_collection(Course.all)
---
SELECT "courses".* FROM "courses"

  def show
    @course = Course.find(params[:id]).decorate
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "1"]]