coolcourses/app/controllers/sections_controller.rb

  def index
    @sections = Course.find(params[:course_id]).sections
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "sections".* FROM "sections" WHERE "sections"."course_id" = 1