hobbies/app/controllers/hobby_origins_controller.rb

  def show
    @person = Person.find(params[:person_id])
    @origin = @person.hobby_origins.find_by_hobby_id(params[:id])
---
SELECT * FROM "hobby_origins" WHERE ("hobby_origins"."hobby_id" = '1') AND ("hobby_origins".person_id = 1) LIMIT 1